# name = "data"#ვქმნით ცვლადს სახელად name მაგ ცვლადს ტოლობით ვაძლევთ მნიშვნელობას დათას

# surname = "diasamidze"#ვქმნით ცვლადს სახელად surname მაგ ცვლადს ტოლობით ვაძლევთ მნიშვნელობას დიასამიძეს

# age = 100#ვქმნით ცვლადს სახელად age მაგ ცვლადს ტოლობით ვაძლევთ მნიშვნელობას 100

# text = "I am programmer"#ვქმნით ცვლადს სახელად text მაგ ცვლადს ტოლობით ვაძლევთ მნიშვნელობას i am programmer

# #ყველა ცვლადის მნიშვნელობა გარდა age-ისა არის string მონაცემთა ტიპი
# #ამ ცვლადებში ინახება ჩვენზე ბიოგრაფია ანუ ინფორმაცია ჩვენ შესასხებ

# print("My name is" + " " + name + " " + "my surname is" + " " + surname + " " + "my age is" + " " + str(age) + " " + text)
# #რას აკეთებს ეს ყველაფერ რაც გამოვიყენეთ print-ში

# #+ ამატებს ერთმანეთთან წინადადებებს და space-ებს

# #"" გამოიყენება იმისთის რომ წინადადება დაიწეროს და შემდეგ დაიწეროს

# #varriables ვიყენებთ იმისთის რომ დავპრინტოთ ცვლადის მნიშვნელობები რაც არის values

# #print გამოიყენება იმისთვის რომ ეკრანზე გამოიტანოს შედეგი


name = "davit"
surname = "beraia"
age = 12
text = "i am a programmer"



print( "my name is" + " " + name + " " + "my surname is" + " " + surname + " " + "my age is" +  str(age) + " " + text )